In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import sys
#sys.path.append('c:/Pradap/Research/Python-Packages/enrique/')
#sys.path.append('C:/Pradap/Research/Python-Packages/enrique/')
sys.path.append('/scratch/pradap/python-work/enrique/')

In [3]:
import magellan as mg

In [4]:
A = mg.read_csv('../magellan/datasets/table_A.csv', key='ID')
B = mg.read_csv('../magellan/datasets/table_B.csv', key='ID')

In [5]:
#mg.init_jvm('C:\\Program Files\\Java\\jre7\\bin\\server\\jvm.dll')
mg.init_jvm()

True

In [6]:
ab = mg.AttrEquivalenceBlocker()
C = ab.block_tables(A, B, 'zipcode', 'zipcode', l_output_attrs=['name', 'hourly_wage', 'zipcode'],
                    r_output_attrs=['name', 'hourly_wage', 'zipcode'])

In [7]:
C

,_id,ltable.ID,rtable.ID,ltable.name,ltable.hourly_wage,ltable.zipcode,rtable.name,rtable.hourly_wage,rtable.zipcode
0,0,a1,b1,Kevin Smith,30.0,94107,Mark Levene,29.5,94107
1,1,a1,b2,Kevin Smith,30.0,94107,Bill Bridge,32.0,94107
2,2,a1,b6,Kevin Smith,30.0,94107,Michael Brodie,32.5,94107
3,3,a3,b1,William Bridge,32.0,94107,Mark Levene,29.5,94107
4,4,a3,b2,William Bridge,32.0,94107,Bill Bridge,32.0,94107
5,5,a3,b6,William Bridge,32.0,94107,Michael Brodie,32.5,94107
6,6,a2,b3,Michael Franklin,27.5,94122,Mike Franklin,27.5,94122
7,7,a2,b4,Michael Franklin,27.5,94122,Joseph Kuan,26.0,94122
8,8,a2,b5,Michael Franklin,27.5,94122,Alfons Kemper,35.0,94122
9,9,a4,b3,Binto George,32.5,94122,Mike Franklin,27.5,94122
10,10,a4,b4,Binto George,32.5,94122,Joseph Kuan,26.0,94122
11,11,a4,b5,Binto George,32.5,94122,Alfons Kemper,35.0,94122
12,12,a5,b3,Alphonse Kemper,35.0,94122,Mike Franklin,27.5,94122
13,13,a5,b4,Alphonse Kemper,35.0,94122,Joseph Kuan,26.0,94122
14,14,a5,b5,Alphonse Kemper,35.0,94122,Alfons Kemper,35.0,94122

In [8]:
E = ab.block_tables(A, B, 'hourly_wage', 'hourly_wage', l_output_attrs=['birth_year'], r_output_attrs=['birth_year'])

In [9]:
E

   _id ltable.ID rtable.ID  ltable.birth_year  rtable.birth_year
0    0        a2        b3               1988               1988
1    1        a3        b2               1986               1986
2    2        a4        b6               1987               1987
3    3        a5        b5               1984               1984

In [10]:
D = ab.block_candset(C, 'birth_year', 'birth_year')

In [11]:
D

,_id,ltable.ID,rtable.ID,ltable.name,ltable.hourly_wage,ltable.zipcode,rtable.name,rtable.hourly_wage,rtable.zipcode
4,4,a3,b2,William Bridge,32.0,94107,Bill Bridge,32.0,94107
6,6,a2,b3,Michael Franklin,27.5,94122,Mike Franklin,27.5,94122
14,14,a5,b5,Alphonse Kemper,35.0,94122,Alfons Kemper,35.0,94122

In [12]:
F = mg.combine_block_outputs_via_union([C, E])

In [13]:
F

,_id,ltable.ID,rtable.ID,ltable.birth_year,ltable.hourly_wage,ltable.name,ltable.zipcode,rtable.birth_year,rtable.hourly_wage,rtable.name,rtable.zipcode
0,0,a5,b3,1984,35.0,Alphonse Kemper,94122,1988,27.5,Mike Franklin,94122
1,1,a3,b2,1986,32.0,William Bridge,94107,1986,32.0,Bill Bridge,94107
2,2,a4,b3,1987,32.5,Binto George,94122,1988,27.5,Mike Franklin,94122
3,3,a2,b4,1988,27.5,Michael Franklin,94122,1982,26.0,Joseph Kuan,94122
4,4,a4,b6,1987,32.5,Binto George,94122,1987,32.5,Michael Brodie,94107
5,5,a2,b5,1988,27.5,Michael Franklin,94122,1984,35.0,Alfons Kemper,94122
6,6,a1,b2,1989,30.0,Kevin Smith,94107,1986,32.0,Bill Bridge,94107
7,7,a1,b1,1989,30.0,Kevin Smith,94107,1987,29.5,Mark Levene,94107
8,8,a4,b5,1987,32.5,Binto George,94122,1984,35.0,Alfons Kemper,94122
9,9,a4,b4,1987,32.5,Binto George,94122,1982,26.0,Joseph Kuan,94122
10,10,a3,b6,1986,32.0,William Bridge,94107,1987,32.5,Michael Brodie,94107
11,11,a2,b3,1988,27.5,Michael Franklin,94122,1988,27.5,Mike Franklin,94122
12,12,a3,b1,1986,32.0,William Bridge,94107,1987,29.5,Mark Levene,94107
13,13,a5,b5,1984,35.0,Alphonse Kemper,94122,1984,35.0,Alfons Kemper,94122
14,14,a1,b6,1989,30.0,Kevin Smith,94107,1987,32.5,Michael Brodie,94107
15,15,a5,b4,1984,35.0,Alphonse Kemper,94122,1982,26.0,Joseph Kuan,94122

In [14]:
S = mg.sample_one_table(F, 14)

In [15]:
L = mg.label(S, 'gold_label')

In [16]:
L.dtypes

_id                     int64
ltable.ID              object
rtable.ID              object
ltable.birth_year       int64
ltable.hourly_wage    float64
ltable.name            object
ltable.zipcode          int64
rtable.birth_year       int64
rtable.hourly_wage    float64
rtable.name            object
rtable.zipcode          int64
gold_label              int64
dtype: object

In [17]:
feat_table = mg.get_features_for_blocking(A, B)

WARNING:magellan.feature.autofeaturegen:address type and address type are different

In [18]:
feat_table

,feature_name,left_attribute,right_attribute,left_attr_tokenizer,right_attr_tokenizer,simfunction,function,function_source
0,ID_ID_lev,ID,ID,None,None,lev,<function ID_ID_lev at 0x7fd308e96668>,from magellan.feature.simfunctions import *\nf...
1,name_name_jac_qgm_3_qgm_3,name,name,qgm_3,qgm_3,jaccard,<function name_name_jac_qgm_3_qgm_3 at 0x7fd30...,from magellan.feature.simfunctions import *\nf...
2,name_name_jac_qgm_2_qgm_3,name,name,qgm_2,qgm_3,jaccard,<function name_name_jac_qgm_2_qgm_3 at 0x7fd30...,from magellan.feature.simfunctions import *\nf...
3,birth_year_birth_year_rdf,birth_year,birth_year,None,None,rel_diff,<function birth_year_birth_year_rdf at 0x7fd30...,from magellan.feature.simfunctions import *\nf...
4,hourly_wage_hourly_wage_rdf,hourly_wage,hourly_wage,None,None,rel_diff,<function hourly_wage_hourly_wage_rdf at 0x7fd...,from magellan.feature.simfunctions import *\nf...
5,zipcode_zipcode_rdf,zipcode,zipcode,None,None,rel_diff,<function zipcode_zipcode_rdf at 0x7fd308e96230>,from magellan.feature.simfunctions import *\nf...

In [19]:
s_prime = mg.extract_feat_vecs(L, attrs_before=None, feat_table=feat_table, attrs_after=['gold_label'])

In [20]:
s_prime.dtypes

_id                              int64
ltable.ID                       object
rtable.ID                       object
ID_ID_lev                      float64
name_name_jac_qgm_3_qgm_3      float64
name_name_jac_qgm_2_qgm_3      float64
birth_year_birth_year_rdf        int64
hourly_wage_hourly_wage_rdf    float64
zipcode_zipcode_rdf              int64
gold_label                       int64
dtype: object

In [21]:
s_prime_df = s_prime.to_dataframe()

In [22]:
s_prime_df.dtypes

_id                              int64
ltable.ID                       object
rtable.ID                       object
ID_ID_lev                      float64
name_name_jac_qgm_3_qgm_3      float64
name_name_jac_qgm_2_qgm_3      float64
birth_year_birth_year_rdf        int64
hourly_wage_hourly_wage_rdf    float64
zipcode_zipcode_rdf              int64
gold_label                       int64
dtype: object

In [23]:
cols = feat_table['feature_name']

In [24]:
x = s_prime_df[list(cols)].values

In [31]:
y = s_prime_df['gold_label'].values

In [32]:
y

array([0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0])

In [33]:
from sklearn.naive_bayes import GaussianNB

In [34]:
s_prime_df['gold_label'].values

array([0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0])

In [35]:
nb = GaussianNB()

In [36]:
nb.fit(x, y)

GaussianNB()